[{"ID":"R1","Date":"Sun Sep 27 2015","Rating":4,"Comment":"Love that this bath toy doesn't get funky and mildewed. I don't even know why the rubber duckies with the holes are even sold...they get disgusting! Glad I don't have to worry about that anymore! :)","___FK_aae773cdd9453edc0ae2cde0":"P3219","___FK_8be2dbb58e3c69a60ae2cde0":"Rev4"},{"ID":"R2","Date":"Mon Sep 28 2015","Rating":5,"Comment":"Excellent for water temperature safety.","___FK_aae773cdd9453edc0ae2cde0":"P3219","___FK_8be2dbb58e3c69a60ae2cde0":"Rev3"},{"ID":"R3","Date":"Sat Oct 10 2015","Rating":4,"Comment":"Very good, satisfied shopping","___FK_aae773cdd9453edc0ae2cde0":"P3219","___FK_8be2dbb58e3c69a60ae2cde0":"Rev2"},{"ID":"R4","Date":"Mon Aug 17 2015","Rating":4,"Comment":"Good","___FK_aae773cdd9453edc0ae2cde0":"P3219","___FK_8be2dbb58e3c69a60ae2cde0":"Rev5"},{"ID":"R5","Date":"Sat Jul 11 2015","Rating":4,"Comment":"This toy is a great amount of fun for everyone, regardless of age.\r\r\r\r\r\n\r\r\r\r\r\nPros:\r\r\r\r\r\n1. My son, who is 18 months old, really enjoys playing with these blocks. Bonus, he cannot eat them!\r\r\r\r\r\n2. The wheeled base is a lot of fun. We have made cars, airplanes and other fun objects on it. My son will also just play with the wheeled base on its own.\r\r\r\r\r\n3. The bag is very durable. My son has not found a way to destroy it yet.\r\r\r\r\r\n\r\r\r\r\r\nCons:\r\r\r\r\r\n1. I went online to look at the other models and designs, and most of them require two sets of blocks. I would like to see more models that can be designed with just single set.\r\r\r\r\r\n\r\r\r\r\r\nOverall, I highly recommend this product!","___FK_aae773cdd9453edc0ae2cde0":"P4484","___FK_8be2dbb58e3c69a60ae2cde0":"Rev3"},{"ID":"R6","Date":"Mon Oct 12 2015","Rating":5,"Comment":"I think our son played with these blocks for about a month straight when we have them to him and he still loves them! We had to show him what to do of course. He is 21 months old. I highly suggest them for all the kids and I also suggest interactive play with parents. My husband takes the time to sit with our son and create shapes like giraffes or anything you can think of! It has become a great toy in our house where our son can play by himself for periods at a time or he will invite us to play with him and we have so much fun!","___FK_aae773cdd9453edc0ae2cde0":"P4484","___FK_8be2dbb58e3c69a60ae2cde0":"Rev1"},{"ID":"R7","Date":"Thu Oct 01 2015","Rating":2,"Comment":"This baseball is plasticy to the touch. As the players hands get sweaty or damp, the ball gets slicker, unlike genuine leather balls. It's a low quality ball, and not even good for playing catch.","___FK_aae773cdd9453edc0ae2cde0":"P4485","___FK_8be2dbb58e3c69a60ae2cde0":"Rev4"},{"ID":"R8","Date":"Fri Oct 02 2015","Rating":4,"Comment":"The ball is a little slicker than I prefer, and the stitching isn't quite what I expected (a little too tight so the leather bunches around the seams) but its good for what i needed it for.","___FK_aae773cdd9453edc0ae2cde0":"P4485","___FK_8be2dbb58e3c69a60ae2cde0":"Rev3"},{"ID":"R9","Date":"Fri Aug 14 2015","Rating":5,"Comment":"Great baseball, great price, worked perfectly for playing catch with my sons. I think that it's wonderful. Works well. Holds up over time.","___FK_aae773cdd9453edc0ae2cde0":"P4485","___FK_8be2dbb58e3c69a60ae2cde0":"Rev5"},{"ID":"R10","Date":"Mon May 11 2015","Rating":5,"Comment":"So glad to have finally found a xylophone with correct pitch! Would love it even more with two mallets.","___FK_aae773cdd9453edc0ae2cde0":"P4486","___FK_8be2dbb58e3c69a60ae2cde0":"Rev4"},{"ID":"R11","Date":"Fri Jun 05 2015","Rating":5,"Comment":"We bought this xylophone for our 1-year-old granddaughter, who enjoys banging on different objects to hear the noise each of them makes. I looked locally, but all I could find were xylophones for older children. She loves it. But, better yet, the tone is so clear, it makes an enjoyable sound when played and is easy on the ears. Since she has only had it a short while, I can only guess as to its long-term durability, although it seems quite sturdy.","___FK_aae773cdd9453edc0ae2cde0":"P4486","___FK_8be2dbb58e3c69a60ae2cde0":"Rev3"},{"ID":"R12","Date":"Tue Mar 03 2015","Rating":4,"Comment":"After lots of searching I settled on this model for my 10 month old boy. He's still a little young for this but will grow into it. This is the perfect design for young kids and is well made - in Israel. The pitch is excellent and the design is sturdy. Rounded edges are nice and safe and the kid can't pry off any of the notes. It gets dropped a lot. The mallot is just what you want too, as they will stick it in their mouth and run around with it, so you don't want the standard stick. Worth the exra money!","___FK_aae773cdd9453edc0ae2cde0":"P4486","___FK_8be2dbb58e3c69a60ae2cde0":"Rev6"},{"ID":"R13","Date":"Tue Jul 14 2015","Rating":1,"Comment":"I wasted an hour of my life with this boat that I'll never get back. At first, I was delighted. It's the right side and a great-looking decorative piece. But you have to untangle the strings and figure out where they hook onto. I ended up throwing it in the trash. I couldn't spend another second trying to work those strings out. So disappointed.","___FK_aae773cdd9453edc0ae2cde0":"P4487","___FK_8be2dbb58e3c69a60ae2cde0":"Rev3"},{"ID":"R14","Date":"Sat Aug 15 2015","Rating":5,"Comment":"I solely purchased it as part of my nautical decor. Never planned nor have tried it in the water. Easy to assemble. Never had a problem with the sail or the strings. The stand does not come attached. I simply used a hot glue gun to glue the pieces together. Hot glue is easy to remove with alcohol and does not damage the paint. I'm happy with the quality.","___FK_aae773cdd9453edc0ae2cde0":"P4487","___FK_8be2dbb58e3c69a60ae2cde0":"Rev5"}]